app/controllers/creatures_controller.rb

SELECT "creatures".* FROM "creatures"
---
  def index
    #get all creatures from db and save to instance variable
    @creatures = Creature.all

INSERT INTO "creatures" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Ambrotious"], ["description", "A small muppet dog"], ["created_at", "2016-01-06 21:37:10.036634"], ["updated_at", "2016-01-06 21:37:10.036634"]]
---
  def create
    creature_params =

    creature = Creature.new(creature_params)

    if creature.save

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = ? LIMIT 1  [["id", 5]]
---
  def show

    creature_id = params[:id]

    @creature = Creature.find_by_id(creature_id)

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    # get the creature id from the url params
    creature_id = params[:id]

    # use `creature_id` to find the creature in the database
    # and save it to an instance variable
    @creature = Creature.find_by_id(creature_id)

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "creatures" SET "description" = ?, "updated_at" = ? WHERE "creatures"."id" = ?  [["description", "Little green man :)"], ["updated_at", "2016-01-06 23:12:21.131556"], ["id", 1]]
---
  def update

    creature_id = params[:id]

    creature = Creature.find_by_id(creature_id)

    creature_params = get_creature_params

    creature.update_attributes(creature_params)

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "creatures" WHERE "creatures"."id" = ?  [["id", 1]]
---
  def destroy

    creature_id = params[:id]

    creature = Creature.find_by_id(creature_id)

    creature.destroy